Get current active external application or external command id.
  Namespace:   Autodesk.Revit.UI
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public AddInId ActiveAddInId { get; }
  Visual Basic
Public ReadOnly Property ActiveAddInId As AddInId
	Get
  Visual C++
public:
property AddInId^ ActiveAddInId {
	AddInId^ get ();
}
 See Also
  UIControlledApplication Class
  Autodesk.Revit.UI Namespace